{
  "Examples": [
    {
      "name": "Forward Sampling - Stochastic Wave Loads on a Frame Structure - JONSWAP Spectra",
      "description": "Generate a stochastic wave loading on a simple structure using a stochastic wave spectra in a local UQ workflow. The structure is a simple 1-story OpenSees structure. Engineering Demand Parameters are PFA, RMSA, PFD, and PID. The wave loading is generated using a stochastic wave spectra (JONSWAP). The wave loading is applied to the floors as lateral forces.",
      "inputFile": "hdro-0005/src/input.json"
    },
    {
      "name": "Sensitivity Analysis - Stochastic Wave Loading on a Frame Structure - JONSWAP Spectra",
      "description": "Generate a Gaussian Process (GP) surrogate model for stochastic wave loading on a simple frame structure using a stochastic wave spectra in a local UQ workflow. The structure is a simple 1-story OpenSees frame structure. Engineering Demand Parameters are PFA, RMSA, PFD, and PID. The wave loading is generated using a stochastic wave spectra (JONSWAP). The wave loading is applied to the floors as lateral forces.",
      "inputFile": "hdro-0005/src/input_Sensitivity.json"
    },
    {
      "name": "Reliability Analysis - Stochastic Wave Loading on a Frame Structure - JONSWAP Spectra",
      "description": "Generate a Gaussian Process (GP) surrogate model for stochastic wave loading on a simple frame structure using a stochastic wave spectra in a local UQ workflow. The structure is a simple 1-story OpenSees frame structure. Engineering Demand Parameters are PFA, RMSA, PFD, and PID. The wave loading is generated using a stochastic wave spectra (JONSWAP). The wave loading is applied to the floors as lateral forces.",
      "inputFile": "hdro-0005/src/input_Reliability.json"
    },
    {
      "name": "Surrogate Model (Gaussian Process) - Stochastic Wave Loading on a Frame Structure - JONSWAP Spectra",
      "description": "Generate a Gaussian Process (GP) surrogate model for stochastic wave loading on a simple frame structure using a stochastic wave spectra in a local UQ workflow. The structure is a simple 1-story OpenSees frame structure. Engineering Demand Parameters are PFA, RMSA, PFD, and PID. The wave loading is generated using a stochastic wave spectra (JONSWAP). The wave loading is applied to the floors as lateral forces.",
      "inputFile": "hdro-0005/src/input_GP.json"
    },
    {
      "name": "Digital Twin of OSU LWF - Simple Multi-Story Structure Example - FOAMySees",
      "description": "This example takes a brief look at uncertainty quantification in a three story shear frame subjected to earthquake loading.",
      "inputFile": "hdro-0001/src/input.json"
    },
    {
      "name": "Digital Twin of OSU LWF - Debris Impacts in a Tsunami-Like Wave - Claymore MPM",
      "description": "This example takes a brief look at uncertainty quantification in a three story shear frame subjected to earthquake loading.",
      "inputFile": "hdro-0002/src/input.json"
    },
    {
      "name": "Digital Twin of UW WASIRF - Coupled Digital Twin - Simple Cantilevered Cylinder Half-Submerged in Crossflow - FOAMySees",
      "description": "This example takes a brief look at uncertainty quantification in a three story shear frame subjected to earthquake loading.",
      "inputFile": "hdro-0003/src/input.json"
    },
    {
      "name": "Digital Twin of WU TWB - Debris Motion through Obstacles in a Tsunami-Like Wave - Claymore MPM",
      "description": "Simulating experiments by Nils Goseberg et al. (2016) regarding debris motion through varied arrays of square column obstacles. Debris represent 1:40 Froude scaled shipping containers in a port setting. An elongated solitary wave is generated by the vacuum chamber of Waseda University's Tsunami Wave Basin. Debris spreading angle, longtiudinal displacement, and impact loads on obstacles are measured.",
      "inputFile": "hdro-0004/src/input.json"
    }
  ]
}
